app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test title"], ["content", "test content"], ["created_at", "2022-08-24 04:18:32.827374"], ["updated_at", "2022-08-24 04:18:32.827374"]]
---
  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save